In [1]:
# Add the Pandas Dependency

import pandas as pd

In [2]:
# Files to load

school_data_to_load = "Resources/schools_complete.csv"
students_data_to_load = "Resources/students_complete.csv"

In [3]:
# Read the school data and store as DF

school_data_df = pd.read_csv(school_data_to_load)
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [4]:
# Read and save Students info as df

students_data_df = pd.read_csv(students_data_to_load)
students_data_df.head(5)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
# Determine if there are any missing values in School DF
 
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [6]:
# Determine if there are any null fields in the student df

students_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [7]:
# Determine missing School Data with .isnull

school_data_df.isnull().sum()

School ID      0
school_name    0
type           0
size           0
budget         0
dtype: int64

In [8]:
# Above with .notnull()
school_data_df.notnull().sum()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [9]:
# Above performed on Students

students_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [10]:
# Using .notnull()
students_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [11]:
# Determine Data Types
school_data_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [12]:
# Include the prefix and suffix list of terms to remove from the students who thought it was a good idea

prefixes_suffixes = ["Dr. ", "Mr. ", "Mrs. ", "Ms. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [13]:
# Iterate through the students and remove their ridiculous titles

for word in prefixes_suffixes:
    students_data_df["student_name"] = students_data_df["student_name"].str.replace(word, "")
    
students_data_df

C:\Users\justi\AppData\Local\Temp\ipykernel_14784\84852889.py:4: FutureWarning: The default value of regex will change from True to False in a future version.
  students_data_df["student_name"] = students_data_df["student_name"].str.replace(word, "")

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [14]:
# Combine the data into a single dataset.

school_data_complete_df = pd.merge(students_data_df, school_data_df, on=["school_name", "school_name"])

school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [15]:
# Get the total number of students.
student_count = school_data_complete_df["Student ID"].count()
student_count

39170

In [16]:
# Get the total number of schools. The unique call returns an array of ndim
school_count = len(school_data_complete_df["school_name"].unique())
school_count

15

In [17]:
# Find the total budget using the school_data_df 
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [18]:
# Calculate the mean reading score:
mean_reading_score = school_data_complete_df["reading_score"].mean()
mean_reading_score

81.87784018381414

In [19]:
# Calculate the mean math score:
mean_math_score = school_data_complete_df["math_score"].mean()
mean_math_score

78.98537145774827

In [20]:
# To determine a passing grade, the score must be at least 70%

passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math_count = passing_math["student_name"].count()

passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
passing_reading_count = passing_reading["student_name"].count()

In [21]:
print(passing_math_count)
print(passing_reading_count)

29370
33610

In [22]:
# Calculate the total students who passed math

passed_math_percentage = passing_math_count / float(student_count) * 100

# Calculate the total students who passed reading

passed_reading_percentage = passing_reading_count / float(student_count) * 100

print(passed_math_percentage)
print(passed_reading_percentage)

74.9808526933878
85.80546336482001

In [23]:
# Calculate the total students who passed both
passed_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)] 
                                                                                               
passed_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [24]:
# Calculate the numbner of students who passed both reading and math

overall_passing_math_reading_count = passed_math_reading["student_name"].count()

# Calculate the overall passing percentage
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983

In [25]:
# Add a list of values with keys to create a new dataframe

district_summary_df = pd.DataFrame(
    [{"Total Schools": school_count, 
     "Total Students": student_count, 
      "Total Budget": total_budget, 
      "Average Math Score": mean_math_score, 
      "Average Reading Score": mean_reading_score, 
      "% Passing Math": passed_math_percentage,
      "% Passing Reading": passed_reading_percentage,
      "% Overall Passing": overall_passing_percentage
     }])

district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [26]:
# Format the numbers in the df

# Add commas to the numbers over 1000
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

# Add a $ symbol, commas, and double decimals to budget
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

# Change the percentages to single decimal
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [27]:
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [29]:
# If needed, Reorder the columns - the current order is correct. 
# new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]
# district_summary_df = district_summary_df[new_column_order]
# district_summary_df